src/Catalogs/НастройкиАнализаСостоянияИнформационнойБазы/НастройкиАнализаСостоянияИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиАнализаСостоянияИнформационнойБазы</name>
  <attributes>
    <name>ИспользоватьВесовыеКоэффициенты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализаДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийКоэффициентКорреляцииПрироста</name>
    <comment>Используется, если используются весовые коэффициенты</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентКорреляцииПользовательскойАктивности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализаАктивности</name>
    <comment>Сколько недель брать для сравнения с проверяемой</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодАнализаАктивности</name>
    <comment>0 - Искать максимальный коэффициент корреляции, 1 - рассчитывать средний коэффициент корреляции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяПользовательскаяАктивность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДемоБазы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриростДанных</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОперацииСтатистикиКонфигурации</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйПрирост</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентКорреляции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесовойКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НастройкиАнализаСостоянияИнформационнойБазы/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Результат = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(1, ПриростДанных.ВыгрузитьКолонку("ВесовойКоэффициент"), 2);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Инд = 0 По Результат.Количество()-1 Цикл
		ПриростДанных[Инд].ВесовойКоэффициент = Результат[Инд];
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Конфигурации.Конфигурация КАК Конфигурация
	                      |ПОМЕСТИТЬ ВТ_Конфигурации
	                      |ИЗ
	                      |	&Конфигурации КАК Конфигурации
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Конфигурация КАК Конфигурация,
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.НастройкиАнализаСостоянияИнформационнойБазы.Конфигурации КАК НастройкиАнализаСостоянияИнформационнойБазыКонфигурации
	                      |ГДЕ
	                      |	НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Ссылка <> &Ссылка
	                      |	И НастройкиАнализаСостоянияИнформационнойБазыКонфигурации.Конфигурация В
	                      |			(ВЫБРАТЬ
	                      |				ВТ_Конфигурации.Конфигурация КАК Конфигурация
	                      |			ИЗ
	                      |				ВТ_Конфигурации КАК ВТ_Конфигурации)");
	Запрос.УстановитьПараметр("Конфигурации", Конфигурации.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = "Конфигурация " + Строка(Выборка.Конфигурация) + " используется в настройке " + Строка(Выборка.Ссылка);
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры
